#3. (12 ქულა) Დაწერეთ თამაში rock, paper, scissor. Დაწერეთ ფუნქცია რომელიც
# დააგენერირებს შემთხვევითად ერთ-ერთ სიმბოლოს ჩამოთვლილი სამიდან R,P,S. 
#Დაწერეთ მეორე ფუნქცია main, რომელშიც მომხმარებელს შეაყვანინებთ თავის არჩევანს R, P ან S.
# სიმარტივისთვის შეგიძლიათ უგულებელყოთ ყველა შემოწმება მომხმარებლის ინფუთზე. 
#Შეადარეთ ერთმანეთს მომხმარებლის შემოყვანილი სიმბოლო და თქვენი ფუნქციის დაგენერირებული
# სიმბოლო და გამოავლინეთ გამარჯვებული. 
#Წესები: 
#R ამარცხებს S
# S ამარცხებს P
# P ამარცხებს R 
#P P, R R, S S არის ფრე

import random

list = ["R", "P", "S"]

def random_symbol():
    return random.choice([list])

user_input = input("Enter the symbol: ")

if user_input == random_symbol:
    print("No winner")
