#2. (8 ქულა) Დაწერეთ პროგრამა რომელიც მოხმარებელს მოსთხოვს შეიყვანოს მთელი რიცხვი n, 
#სადაც 100<= n < 1000. Თუ მომხმარებელი შეიყვანს არასწორ რიცხვს ეკრანზე დაბეჭდეთ რომ პროგრამას
# გადმოეცა არასწორი რიცხვი და შეწყვიტეთ პროგრამის მუშაობა. Თუ მომხმარებელი შეიყვანს სწორ რიცხვს,
# პროგრამამ უნდა იპოვოს ყველა 13 ის ჯერადი რიცხვი 1-დან n-მდე. Ეკრანზე დაბეჭდოს ეს რიცხვები და მათი საერთო რაოდენობა.

n = int(input("Please, enter the number: "))

if 100 <= n < 1000:
    for i in range(1,n+1):
        if i % 13 == 0:
            print(i, end=" ")
                            
else:
    print("Number is out of range")
